In [2]:
import pandas as pd

In [5]:
s=pd.Series([1,2,3,4,5])

In [6]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
s=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])

In [8]:
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [9]:
print(s[0])

1

In [10]:
print(s['d'])

4

In [11]:
d=pd.DataFrame([1,2,3,4])

In [12]:
d

   0
0  1
1  2
2  3
3  4

In [13]:
c=pd.DataFrame({'name':['tom','dick','harry'],'Age':[28,29,20]})

In [14]:
c

    name  Age
0    tom   28
1   dick   29
2  harry   20

In [15]:
c=pd.DataFrame({'name':['tom','dick','harry'],'Age':[28,29,20]},index=["c1","c2","c3"])

In [16]:
c

     name  Age
c1    tom   28
c2   dick   29
c3  harry   20

In [18]:
c.loc['c1','Age']

28

In [20]:
c.iloc[2,1]

20

In [21]:
name=pd.DataFrame({"name":["abhinav","narayan","kushal"]})
age=pd.DataFrame({'Ages':[20,21,22]})

In [22]:
l=pd.concat([name,age],axis=1)

In [23]:
l

      name  Ages
0  abhinav    20
1  narayan    21
2   kushal    22

In [29]:
l[l['Ages']<=25][['name']]

      name
0  abhinav
1  narayan
2   kushal

In [30]:
r=pd.DataFrame({'name':["abhi","nar","nil"],'Age':[20,21,22],'University':['Amity','BHU','IIT']})

In [31]:
r

   name  Age University
0  abhi   20      Amity
1   nar   21        BHU
2   nil   22        IIT

In [32]:
r.to_csv('student.csv',index=False)

In [33]:
l=pd.read_csv('student.csv')

In [34]:
l

   name  Age University
0  abhi   20      Amity
1   nar   21        BHU
2   nil   22        IIT

In [35]:
l['city']=['Noida','Banarus','Delhi']

In [36]:
l

   name  Age University     city
0  abhi   20      Amity    Noida
1   nar   21        BHU  Banarus
2   nil   22        IIT    Delhi

In [37]:
l.columns=['First_name','Current_Age','Collage_University','Location']

In [38]:
l

  First_name  Current_Age Collage_University Location
0       abhi           20              Amity    Noida
1        nar           21                BHU  Banarus
2        nil           22                IIT    Delhi

In [41]:
l.drop(columns=['Current_Age'],axis=1,inplace=True)

In [42]:
l

  First_name Collage_University Location
0       abhi              Amity    Noida
1        nar                BHU  Banarus
2        nil                IIT    Delhi

In [3]:
data=pd.DataFrame({'name':['A','A','A','A','B','B','B','B'],'Points':[10,10,12,12,15,17,20,20],'assits':[5,5,7,9,12,9,6,6]})

In [4]:
data

  name  Points  assits
0    A      10       5
1    A      10       5
2    A      12       7
3    A      12       9
4    B      15      12
5    B      17       9
6    B      20       6
7    B      20       6

In [5]:
d=data.duplicated()

In [7]:
data[d]

  name  Points  assits
1    A      10       5
7    B      20       6

team=data.duplicate(['name'])

In [9]:
team=data.duplicated(['name'])

In [10]:
data[team

0    False
1     True
2     True
3     True
4    False
5     True
6     True
7     True
dtype: bool

In [11]:
data.drop_duplicates()

  name  Points  assits
0    A      10       5
2    A      12       7
3    A      12       9
4    B      15      12
5    B      17       9
6    B      20       6